# GetClTextureR

## Description
Function GetClTextureR returns the right side wall texture of the specified class.

```pascal
FUNCTION GetClTextureR(className : STRING) : LONGINT;
```

```python

def vs.GetClTextureR(className):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Class name.|

## Remarks
Returns the wall right texture of the class named className.

## Version
Availability: from VectorWorks8.0
## Category
* Textures